<a href="https://colab.research.google.com/github/sprabhala-cpu/basics/blob/main/aggregation_in_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
'''how to perform aggregation in pandas
some common aggregating functions are
mean()-compute mean of groups
sum()-compute sum of groups
size-computer size of groups
count-compute count of groups
std-standard deviation of groups
var-varience of groips
sem stanadard error of mean of groips
describe()generated descriptive statistisc of groips
first() computes first of ggroup values
last()computes last of group values
nth() take nth value or subset in n in a list
min() computes min of group
max()computes max of groip

In [ ]:
import numpy as np
np.random.seed(123)
df = pd.DataFrame({'A' : ['foo', 'foo', 'bar', 'foo', 'bar', 'foo'],
                   'B' : ['one', 'two', 'three','two', 'two', 'one'],
                   'C' : np.random.randint(5,size=6),
                   'D' : np.random.randint(5, size=6),
                   'E' : np.random.randint(5, size=6)})

In [ ]:
df

     A      B  C  D  E
0  foo    one  2  3  0
1  foo    two  4  1  0
2  bar  three  2  1  1
3  foo    two  1  0  3
4  bar    two  3  1  4
5  foo    one  2  1  0

In [ ]:
df1=df.groupby(['A','B'],as_index=False).sum()

In [ ]:
df1

     A      B  C  D  E
0  bar  three  2  1  1
1  bar    two  3  1  4
2  foo    one  4  4  0
3  foo    two  5  1  3

In [ ]:
'''aggregare function is using all columns that are not specified in groupby
we can also specify only some columns for aggration in a list agete groupby'''

In [ ]:
df2=df.groupby(['A','B'],as_index=False)['C','D'].sum()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

In [ ]:
df1=df.groupby(['A','B'],as_index=False)['C'].sum()

In [ ]:
df1

     A      B  C
0  bar  three  2
1  bar    two  3
2  foo    one  4
3  foo    two  5

In [ ]:
df1=df.groupby(['A','B'],as_index=False)['C'].agg('sum')

In [ ]:
df1

     A      B  C
0  bar  three  2
1  bar    two  3
2  foo    one  4
3  foo    two  5

In [ ]:
df2=df.groupby(['A','B'],as_index=False).agg('sum')

In [ ]:
df2

     A      B  C  D  E
0  bar  three  2  1  1
1  bar    two  3  1  4
2  foo    one  4  4  0
3  foo    two  5  1  3

In [ ]:
'''for multiple functions applied for a oone column use a list of tuples name of 
new columns'''

'for multiple functions applied for a oone column use a list of tuples name of \nnew columns'

In [ ]:
df4=df.groupby(['A','B'])['C'].agg([('average','mean'),('total','sum')]).reset_index()

In [ ]:
df4

     A      B  average  total
0  bar  three      2.0      2
1  bar    two      3.0      3
2  foo    one      2.0      4
3  foo    two      2.5      5

In [ ]:
df5=df.groupby(['A','B']).agg([('average','mean'),('total','sum')])

In [ ]:
df5

                C             D             E
          average total average total average total
A   B
bar three     2.0     2     1.0     1     1.0     1
    two       3.0     3     1.0     1     4.0     4
foo one       2.0     4     2.0     4     0.0     0
    two       2.5     5     0.5     1     1.5     3

In [ ]:
print(df5.columns)

Index(['C_average', 'C_total', 'D_average', 'D_total', 'E_average', 'E_total'], dtype='object')

In [ ]:
#converting multiindex into normal
#flattening multiindex use map
df5.columns=df5.columns.map('_'.join)

In [ ]:
df5.reset_index()

     A      B  C_average  C_total  D_average  D_total  E_average  E_total
0  bar  three        2.0        2        1.0        1        1.0        1
1  bar    two        3.0        3        1.0        1        4.0        4
2  foo    one        2.0        4        2.0        4        0.0        0
3  foo    two        2.5        5        0.5        1        1.5        3

In [ ]:
df5=df.groupby(['A','B']).agg(['mean','sum'])
df5.columns=(df5.columns.map('_'.join)
            .str.replace('sum','total')
            .str.replace('mean','average'))

In [ ]:
df5

           C_average  C_total  D_average  D_total  E_average  E_total
A   B
bar three        2.0        2        1.0        1        1.0        1
    two          3.0        3        1.0        1        4.0        4
foo one          2.0        4        2.0        4        0.0        0
    two          2.5        5        0.5        1        1.5        3

In [ ]:
'''if you want specified each column with aggrgated function pass seperatelu'''
df6=df.groupby(['A','B'],as_index=False).agg({'C':'sum','D':'mean'}).rename(columns={'C':'C_total','D':'D_mean'})

In [ ]:
type(df6)

pandas.core.frame.DataFrame

In [ ]:
df1=df.groupby(['A','B'])['C'].sum()

In [ ]:
df1

A    B
bar  three    2
     two      3
foo  one      4
     two      5
Name: C, dtype: int64

In [ ]:
type(df1)

pandas.core.series.Series

In [ ]:
df1

A    B
bar  three    2
     two      3
foo  one      4
     two      5
Name: C, dtype: int64

In [ ]:
df1=df.groupby(['A','B'])['C'].sum()

In [ ]:
#check index and type of pandas object
df1.index

MultiIndex([('bar', 'three'),
            ('bar',   'two'),
            ('foo',   'one'),
            ('foo',   'two')],
           names=['A', 'B'])

In [ ]:
type(df1)

pandas.core.series.Series

In [ ]:
'''there are 2 solution show to get multiondex series to columsn
'''
df1=df.groupby(['A','B'],as_index=False)['C'].sum()

In [ ]:
df1

     A      B  C
0  bar  three  2
1  bar    two  3
2  foo    one  4
3  foo    two  5

In [ ]:
'''take the series object and reset index'''
df1=df.groupby(['A','B'])['C'].sum().reset_index()

In [ ]:
df1

     A      B  C
0  bar  three  2
1  bar    two  3
2  foo    one  4
3  foo    two  5

In [ ]:
'''groupby with one column'''
df2=df.groupby(by='A')['C'].sum().reset_index()

In [ ]:
df2.rename(columns={'C':'C_sum'})

     A  C_sum
0  bar      5
1  foo      9

In [ ]:
'''how to aggrgare mainly string columns (to lists ,tuples, strings with seperators)
'''
df = pd.DataFrame({'A' : ['a', 'c', 'b', 'b', 'a', 'c', 'b'],
                   'B' : ['one', 'two', 'three','two', 'two', 'one', 'three'],
                   'C' : ['three', 'one', 'two', 'two', 'three','two', 'one'],
                   'D' : [1,2,3,2,3,1,2]})

In [ ]:
df

   A      B      C  D
0  a    one  three  1
1  c    two    one  2
2  b  three    two  3
3  b    two    two  2
4  a    two  three  3
5  c    one    two  1
6  b  three    one  2

In [ ]:
#instrad of an aggrgation function it is possible to pass list,tuple or set
df1=df.groupby('A')['B'].agg(list).reset_index()

In [ ]:
df1

   A                    B
0  a           [one, two]
1  b  [three, two, three]
2  c           [two, one]

In [ ]:
df1=df.groupby('A')['B'].agg(list).reset_index()

In [ ]:
df1

   A                    B
0  a           [one, two]
1  b  [three, two, three]
2  c           [two, one]

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      object
 1   B       3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [ ]:
#for converting to string with seperator use join functiononly if the colum is string

In [ ]:
df

   A      B      C  D
0  a    one  three  1
1  c    two    one  2
2  b  three    two  3
3  b    two    two  2
4  a    two  three  3
5  c    one    two  1
6  b  three    one  2

In [ ]:
df1=df.groupby('A')['B'].agg(','.join).reset_index()

In [ ]:
df1

   A                B
0  a          one,two
1  b  three,two,three
2  c          two,one

In [ ]:
df1=df.groupby('A')['D'].agg(lambda x:','.join (x.astype(str))).reset_index()

In [ ]:
df1

   A      D
0  a    1,3
1  b  3,2,2
2  c    2,1

In [ ]:
#conother solution os convering to string before groupb y
df3=df.assign(D=df['D'].astype(str)).groupby('A')['D'].agg(','.join).reset_index()

In [ ]:
df3

   A      D
0  a    1,3
1  b  3,2,2
2  c    2,1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      object
 1   B       7 non-null      object
 2   C       7 non-null      object
 3   D       7 non-null      int64
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [ ]:
df4=df.groupby('A').agg('$'.join)

In [ ]:
df4

                 B            C
A
a          one$two  three$three
b  three$two$three  two$two$one
c          two$one      one$two

In [ ]:
'''how to aggregate counts'''
df = pd.DataFrame({'A' : ['a', 'c', 'b', 'b', 'a', 'c', 'b'],
                   'B' : ['one', 'two', 'three','two', 'two', 'one', 'three'],
                   'C' : ['three', np.nan, np.nan, 'two', 'three','two', 'one'],
                   'D' : [np.nan,2,3,2,3,np.nan,2]})

In [ ]:
df

   A      B      C    D
0  a    one  three  NaN
1  c    two    NaN  2.0
2  b  three    NaN  3.0
3  b    two    two  2.0
4  a    two  three  3.0
5  c    one    two  NaN
6  b  three    one  2.0

In [ ]:
df1=df.groupby('A').size().reset_index(name='Count')

In [ ]:
df1

   A  Count
0  a      2
1  b      3
2  c      2

In [ ]:
#groupby count
df.groupby('A')['C','D'].count().reset_index()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

   A  C  D
0  a  2  1
1  b  2  3
2  c  1  1

In [ ]:
df3=df.groupby('A').count().add_suffix('_count').reset_index()

In [ ]:
df3

   A  B_count  C_count  D_count
0  a        2        2        1
1  b        3        2        3
2  c        2        1        1

In [ ]:
df3=df.groupby('A')['C','D'].count().add_suffix('_count').reset_index()#count gets only non null vlaues

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

In [ ]:
df3

   A  C_count  D_count
0  a        2        1
1  b        2        3
2  c        1        1

In [ ]:
df.groupby('A').size().reset_index(name='size')

   A  size
0  a     2
1  b     3
2  c     2

In [ ]:
df4=df['A'].value_counts().sort_index().rename_axis('A').reset_index(name='Count')

In [ ]:
df4

   A  Count
0  a      2
1  b      3
2  c      2

In [ ]:
'''how to create new column filled by aggregated values'''
'''method groupby .transforem returns an object that is indexed the am as one 
being grouped'''

'method groupby .transforem returns an object that is indexed the am as one \nbeing grouped'

In [ ]:
np.random.seed(123)

df = pd.DataFrame({'A' : ['foo', 'foo', 'bar', 'foo', 'bar', 'foo'],
                    'B' : ['one', 'two', 'three','two', 'two', 'one'],
                    'C' : np.random.randint(5, size=6),
                    'D' : np.random.randint(5, size=6)})

In [ ]:
df

     A      B  C  D
0  foo    one  2  3
1  foo    two  4  1
2  bar  three  2  1
3  foo    two  1  0
4  bar    two  3  1
5  foo    one  2  1

In [ ]:
df['C1']=df.groupby('A')['C'].transform('sum')
df['C2']=df.groupby(['A','B'])['C'].transform('sum')
df[['C3','D3']]=df.groupby('A')['C','D'].transform('sum')

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  This is separate from the ipykernel package so we can avoid doing imports until

In [ ]:
df

     A      B  C  D  C1  C2  C3  D3
0  foo    one  2  3   9   4   9   5
1  foo    two  4  1   9   5   9   5
2  bar  three  2  1   5   2   5   2
3  foo    two  1  0   9   5   9   5
4  bar    two  3  1   5   3   5   2
5  foo    one  2  1   9   4   9   5